<?php
return array(
    'ERROR' => array(
        0 => '成功',
        -1 => '验证失败',
        -2 => '请求无权限',
        -3 => '无数据',
        //wpy
        'A001' => '用户名不合法',
        'A002' => '密码，确认密码不合法',
        'A003' => '手机号不合法',
        'A004' => 'email不合法',
        'A005' => '用户名已存在',
        'A006' => '手机号已存在',
        'A007' => 'email已存在',
        'A008' => '用户名不合法',
        'A009' => '密码不合法',
        'A010' => '用户名或密码错误',
        'A011' => '用户ID不合法',
        'A012' => 'token不合法',
        'A013' => '控制器名不合法',
        'A014' => '方法名不合法',
        'A015' => '权限名称不合法',
        'A016' => '上级权限ID不合法',
        'A017' => '角色名称不合法',
        'A018' => '权限分类不合法',
        'A019' => '角色权限不合法',
        'A020' => '角色Id不合法',
        'A021' => '旧密码不合法',
        'A022' => '权限ID不合法',
        //hxh
        'B001' => '',
        //lyt
        'C001' => '',
    )
);